// getBankFromCardNumber.js

const bankBinMap = {
  '603799': 'بانک ملی ایران',
  '589210': 'بانک سپه',
  '627648': 'بانک توسعه صادرات ایران',
  '627961': 'بانک صنعت و معدن',
  '603770': 'بانک کشاورزی',
  '628023': 'بانک مسکن',
  '627760': 'پست بانک ایران',
  '502908': 'بانک توسعه تعاون',
  '627412': 'بانک اقتصاد نوین',
  '622106': 'بانک پارسیان',
  '502229': 'بانک پاسارگاد',
  '627488': 'بانک کارآفرین',
  '621986': 'بانک سامان',
  '639346': 'بانک سینا',
  '639607': 'بانک سرمایه',
  '636214': 'بانک تات (آینده)',
  '502806': 'بانک شهر',
  '502938': 'بانک دی',
  '603769': 'بانک صادرات',
  '610433': 'بانک ملت',
  '627353': 'بانک تجارت',
  '585983': 'بانک رفاه کارگران',
  '589463': 'بانک رفاه (جدید)',
  '639370': 'بانک مهر اقتصاد',
  '627381': 'بانک انصار',
  '505785': 'بانک ایران زمین',
  '606256': 'بانک کشاورزی (جدید)',
};

function getBankFromCardNumber(cardNumber) {
  if (typeof cardNumber !== 'string') return null;
  const sanitized = cardNumber.replace(/[^0-9]/g, '');
  if (sanitized.length !== 16) return null;

  const bin = sanitized.substring(0, 6);
  return bankBinMap[bin] || 'نامشخص';
}

module.exports =  getBankFromCardNumber ;
